const talukasMap = {
  "": [], // Default empty state
  "1": [ // पुणे
    { name: "---Select Tahsil---", value: "" },
    { name: "जुन्नर", value: "1" },
    { name: "आंबेगाव", value: "2" },
    { name: "शिरुर", value: "3" },
    { name: "खेड", value: "4" },
    { name: "मावळ", value: "5" },
    { name: "मुळ्शी", value: "6" },
    { name: "हवेली", value: "7" },
    { name: "पुणे शहर", value: "8" },
    { name: "दौंड", value: "9" },
    { name: "पुरंदर", value: "10" },
    { name: "वेल्हा", value: "11" },
    { name: "भोर", value: "12" },
    { name: "बारामती", value: "13" },
    { name: "ईंदापुर", value: "14" }
  ],
  "10": [ // नाशिक
    { name: "---Select Tahsil----", value: "" },
    { name: "सुरगाणा", value: "1" },
    { name: "कळवण", value: "2" },
    { name: "देवळा", value: "3" },
    { name: "बागलन", value: "4" },
    { name: "मालेगाव", value: "5" },
    { name: "नांदगाव", value: "6" },
    { name: "चांदवड", value: "7" },
    { name: "दिंडोरी", value: "8" },
    { name: "पेठ", value: "9" },
    { name: "त्रिंबक", value: "10" },
    { name: "नाशिक", value: "11" },
    { name: "ईगतपुरी", value: "12" },
    { name: "सिन्नर", value: "13" },
    { name: "निफाड", value: "14" },
    { name: "येवला", value: "15" }
  ],
  "2": ["सातारा", "कराड", "वाई", "पाटण", "जावळी", "कोरेगाव", "खंडाळा", "फलटण", "माण", "खटाव", "कडेगाव"],
  "3": ["सांगली", "मिरज", "कवठेमहांकाळ", "तासगाव", "जत", "शिराळा", "पलूस", "कडेगाव", "आटपाडी", "खानापूर"],
  "4": ["कोल्हापूर", "करवीर", "पन्हाळा", "शाहुवाडी", "हातकणंगले", "शिरोळ", "कागल", "गडहिंग्लज", "भुदरगड", "आजरा", "चंदगड", "राधानगरी"],
  "5": ["सोलापूर", "पंढरपूर", "माळशिरस", "सांगोला", "मोहोळ", "मंगळवेढा", "बार्शी", "अक्कलकोट", "करमाळा", "माढा"],
};

export default talukasMap;